---
title: "AoC Day 10 – Adapter Array"
date: 2020-12-11
tags:
  - raku
categories:
  - code
  - advent
comments: true
---

This is a solution to Advent of Code 2020 day 10, written in Raku.

<!--more-->

[[https://adventofcode.com/2020/day/10]]

#+begin_quote
Find a chain that uses all of your adapters to connect the charging outlet to your device's
built-in adapter and count the joltage differences between the charging outlet, the adapters,
and your device. What is the number of 1-jolt differences multiplied by the number of 3-jolt
differences?
#+end_quote

#+begin_src raku :results output
  my @adaptors = '10-input.txt'.IO.lines.map({+$_}).sort;
  my @uppers = @adaptors;

  @adaptors.unshift(0);
  say @adaptors;

  @uppers.append(@uppers.tail + 3);
  say @uppers;

  my @jolts = @uppers <<-<< @adaptors;
  say @jolts;

  my $ones = +@jolts.grep(* == 1);
  my $threes = +@jolts.grep(* == 3);
  say "{$ones} * {$threes} = {$ones * $threes}";

  @jolts
#+end_src

#+RESULTS:
: [0 1 2 5 6 7 8 9 12 15 16 17 18 19 22 23 24 25 26 29 32 33 34 35 38 39 40 41 42 45 46 47 50 51 52 53 56 57 58 59 62 63 64 65 66 69 72 73 74 75 76 79 80 81 82 83 86 87 88 89 90 93 94 95 96 97 100 101 102 103 106 109 110 111 114 115 116 117 118 121 122 125 126 127 128 129 132 135 136 139 140 141 142 145 146 147 148 149]
: [1 2 5 6 7 8 9 12 15 16 17 18 19 22 23 24 25 26 29 32 33 34 35 38 39 40 41 42 45 46 47 50 51 52 53 56 57 58 59 62 63 64 65 66 69 72 73 74 75 76 79 80 81 82 83 86 87 88 89 90 93 94 95 96 97 100 101 102 103 106 109 110 111 114 115 116 117 118 121 122 125 126 127 128 129 132 135 136 139 140 141 142 145 146 147 148 149 152]
: [1 1 3 1 1 1 1 3 3 1 1 1 1 3 1 1 1 1 3 3 1 1 1 3 1 1 1 1 3 1 1 3 1 1 1 3 1 1 1 3 1 1 1 1 3 3 1 1 1 1 3 1 1 1 1 3 1 1 1 1 3 1 1 1 1 3 1 1 1 3 3 1 1 3 1 1 1 1 3 1 3 1 1 1 1 3 3 1 3 1 1 1 3 1 1 1 1 3]
: 71 * 27 = 1917

#+begin_quote
You glance back down at your bag and try to remember why you brought so many adapters; there
must be more than a trillion valid ways to arrange them! Surely, there must be an efficient way
to count the arrangements.

What is the total number of distinct ways you can arrange the adapters to connect the charging
outlet to your device?
#+end_quote

#+begin_src raku :results output
  my @adaptors = '10-input.txt'.IO.lines.map({+$_}).sort;
  my @uppers = @adaptors;

  @adaptors.unshift(0);
  @uppers.append(@uppers.tail + 3);
  my @jolts = @uppers <<-<< @adaptors;

  my @combinations = @jolts.join.split(/'3'+/, :skip-empty).map({
  when '1111' { 7 }
  when '111' { 4 }
  when '11' { 2 }
  when '1' { 1 }
  });

  say @combinations;
  say [*] @combinations;
#+end_src

#+RESULTS:
: [2 7 7 7 4 7 2 4 4 7 7 7 7 7 4 2 7 1 7 1 4 7]
: 113387824750592
